wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_dma.h
/* channel transfer mode */
#define CHCTL_TM(regval)                    (BIT(4) & ((uint32_t)(regval) << 4U))
#define DMA_PERIPH_TO_MEMORY                CHCTL_TM(0)                                     /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPH                CHCTL_TM(1)                                     /*!< read from memory and write to peripheral */

/* memory to memory mode */
#define DMA_MEMORY_TO_MEMORY_DISABLE        ((uint32_t)0x00000000U)                         /*!<Memory to Memory mode disable*/
#define DMA_MEMORY_TO_MEMORY_ENABLE         ((uint32_t)0x00000001U)                         /*!<Memory to Memory mode enable*/

/* DMA_CHxCNT register */
/* transfer counter */
#define DMA_CHANNEL_CNT_MASK                DMA_CHXCNT_CNT                                  /*!< transfer counter mask */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)             (BITS(0,7) & ((uint32_t)(regval) << 0U))                                     /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                     RM_CHXCFG_MUXID(0U)                                                          /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0              RM_CHXCFG_MUXID(1U)                                                          /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1              RM_CHXCFG_MUXID(2U)                                                          /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2              RM_CHXCFG_MUXID(3U)                                                          /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3              RM_CHXCFG_MUXID(4U)                                                          /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_ADC0_ROUTINE            RM_CHXCFG_MUXID(5U)                                                          /*!< DMAMUX ADC0 ROUTINE request */
#define DMA_REQUEST_ADC0_INSERTED           RM_CHXCFG_MUXID(6U)                                                          /*!< DMAMUX ADC0 INSERTED request */
#define DMA_REQUEST_DAC0_CH0                RM_CHXCFG_MUXID(7U)                                                          /*!< DMAMUX DAC0 CH0 request */
#define DMA_REQUEST_TIMER5_UP               RM_CHXCFG_MUXID(8U)                                                          /*!< DMAMUX TIMER5 UP request */
#define DMA_REQUEST_TIMER6_UP               RM_CHXCFG_MUXID(9U)                                                          /*!< DMAMUX TIMER6 UP request */
#define DMA_REQUEST_SPI0_RX                 RM_CHXCFG_MUXID(10U)                                                         /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX                 RM_CHXCFG_MUXID(11U)                                                         /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_SPI1_RX                 RM_CHXCFG_MUXID(12U)                                                         /*!< DMAMUX SPI1 RX request */
#define DMA_REQUEST_SPI1_TX                 RM_CHXCFG_MUXID(13U)                                                         /*!< DMAMUX SPI1 TX request */
#define DMA_REQUEST_SPI2_RX                 RM_CHXCFG_MUXID(14U)                                                         /*!< DMAMUX SPI2 RX request */
#define DMA_REQUEST_SPI2_TX                 RM_CHXCFG_MUXID(15U)                                                         /*!< DMAMUX SPI2 TX request */
#define DMA_REQUEST_I2C0_RX                 RM_CHXCFG_MUXID(16U)                                                         /*!< DMAMUX I2C0 RX request */
#define DMA_REQUEST_I2C0_TX                 RM_CHXCFG_MUXID(17U)                                                         /*!< DMAMUX I2C0 TX request */
#define DMA_REQUEST_I2C1_RX                 RM_CHXCFG_MUXID(18U)                                                         /*!< DMAMUX I2C1 RX request */
#define DMA_REQUEST_I2C1_TX                 RM_CHXCFG_MUXID(19U)                                                         /*!< DMAMUX I2C1 TX request */
#define DMA_REQUEST_USART0_RX               RM_CHXCFG_MUXID(20U)                                                         /*!< DMAMUX USART0 RX request */
#define DMA_REQUEST_USART0_TX               RM_CHXCFG_MUXID(21U)                                                         /*!< DMAMUX USART0 TX request */
#define DMA_REQUEST_USART1_RX               RM_CHXCFG_MUXID(22U)                                                         /*!< DMAMUX USART1 RX request */
#define DMA_REQUEST_USART1_TX               RM_CHXCFG_MUXID(23U)                                                         /*!< DMAMUX USART1 TX request */
#define DMA_REQUEST_USART2_RX               RM_CHXCFG_MUXID(24U)                                                         /*!< DMAMUX USART2 RX request */
#define DMA_REQUEST_USART2_TX               RM_CHXCFG_MUXID(25U)                                                         /*!< DMAMUX USART2 TX request */
#define DMA_REQUEST_UART3_RX                RM_CHXCFG_MUXID(26U)                                                         /*!< DMAMUX UART3 RX request */
#define DMA_REQUEST_UART3_TX                RM_CHXCFG_MUXID(27U)                                                         /*!< DMAMUX UART3 TX request */
#define DMA_REQUEST_TIMER0_CH0              RM_CHXCFG_MUXID(28U)                                                         /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1              RM_CHXCFG_MUXID(29U)                                                         /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2              RM_CHXCFG_MUXID(30U)                                                         /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3              RM_CHXCFG_MUXID(31U)                                                         /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_UP               RM_CHXCFG_MUXID(32U)                                                         /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_TRG              RM_CHXCFG_MUXID(33U)                                                         /*!< DMAMUX TIMER0 TRG request */
#define DMA_REQUEST_TIMER0_CMT              RM_CHXCFG_MUXID(34U)                                                         /*!< DMAMUX TIMER0 CMT request */
#define DMA_REQUEST_TIMER7_CH0              RM_CHXCFG_MUXID(35U)                                                         /*!< DMAMUX TIMER7 CH0 request */
#define DMA_REQUEST_TIMER7_CH1              RM_CHXCFG_MUXID(36U)                                                         /*!< DMAMUX TIMER7 CH1 request */
#define DMA_REQUEST_TIMER7_CH2              RM_CHXCFG_MUXID(37U)                                                         /*!< DMAMUX TIMER7 CH2 request */
#define DMA_REQUEST_TIMER7_CH3              RM_CHXCFG_MUXID(38U)                                                         /*!< DMAMUX TIMER7 CH3 request */
#define DMA_REQUEST_TIMER7_UP               RM_CHXCFG_MUXID(39U)                                                         /*!< DMAMUX TIMER7 UP request */
#define DMA_REQUEST_TIMER7_TRG              RM_CHXCFG_MUXID(40U)                                                         /*!< DMAMUX TIMER7 TRG request */
#define DMA_REQUEST_TIMER7_CMT              RM_CHXCFG_MUXID(41U)                                                         /*!< DMAMUX TIMER7 CMT request */
#define DMA_REQUEST_TIMER1_CH0              RM_CHXCFG_MUXID(42U)                                                         /*!< DMAMUX TIMER1 CH0 request */
#define DMA_REQUEST_TIMER1_CH1              RM_CHXCFG_MUXID(43U)                                                         /*!< DMAMUX TIMER1 CH1 request */
#define DMA_REQUEST_TIMER1_CH2              RM_CHXCFG_MUXID(44U)                                                         /*!< DMAMUX TIMER1 CH2 request */
#define DMA_REQUEST_TIMER1_CH3              RM_CHXCFG_MUXID(45U)                                                         /*!< DMAMUX TIMER1 CH3 request */
#define DMA_REQUEST_TIMER1_UP               RM_CHXCFG_MUXID(46U)                                                         /*!< DMAMUX TIMER1 UP request */
#define DMA_REQUEST_TIMER1_TRG              RM_CHXCFG_MUXID(47U)                                                         /*!< DMAMUX TIMER1 TRG request */
#define DMA_REQUEST_TIMER2_CH0              RM_CHXCFG_MUXID(48U)                                                         /*!< DMAMUX TIMER2 CH0 request */
#define DMA_REQUEST_TIMER2_CH1              RM_CHXCFG_MUXID(49U)                                                         /*!< DMAMUX TIMER2 CH1 request */
#define DMA_REQUEST_TIMER2_CH2              RM_CHXCFG_MUXID(50U)                                                         /*!< DMAMUX TIMER2 CH2 request */
#define DMA_REQUEST_TIMER2_CH3              RM_CHXCFG_MUXID(51U)                                                         /*!< DMAMUX TIMER2 CH3 request */
#define DMA_REQUEST_TIMER2_UP               RM_CHXCFG_MUXID(52U)                                                         /*!< DMAMUX TIMER2 UP request */
#define DMA_REQUEST_TIMER2_TRG              RM_CHXCFG_MUXID(53U)                                                         /*!< DMAMUX TIMER2 TRG request */
#define DMA_REQUEST_TIMER3_CH0              RM_CHXCFG_MUXID(54U)                                                         /*!< DMAMUX TIMER3 CH0 request */
#define DMA_REQUEST_TIMER3_CH1              RM_CHXCFG_MUXID(55U)                                                         /*!< DMAMUX TIMER3 CH1 request */
#define DMA_REQUEST_TIMER3_CH2              RM_CHXCFG_MUXID(56U)                                                         /*!< DMAMUX TIMER3 CH2 request */
#define DMA_REQUEST_TIMER3_CH3              RM_CHXCFG_MUXID(57U)                                                         /*!< DMAMUX TIMER3 CH3 request */
#define DMA_REQUEST_TIMER3_UP               RM_CHXCFG_MUXID(58U)                                                         /*!< DMAMUX TIMER3 UP request */
#define DMA_REQUEST_TIMER3_TRG              RM_CHXCFG_MUXID(59U)                                                         /*!< DMAMUX TIMER3 TRG request */
#define DMA_REQUEST_TIMER4_CH0              RM_CHXCFG_MUXID(60U)                                                         /*!< DMAMUX TIMER4 CH0 request */
#define DMA_REQUEST_TIMER4_CH1              RM_CHXCFG_MUXID(61U)                                                         /*!< DMAMUX TIMER4 CH1 request */
#define DMA_REQUEST_TIMER4_CH2              RM_CHXCFG_MUXID(62U)                                                         /*!< DMAMUX TIMER4 CH2 request */
#define DMA_REQUEST_TIMER4_CH3              RM_CHXCFG_MUXID(63U)                                                         /*!< DMAMUX TIMER4 CH3 request */
#define DMA_REQUEST_TIMER4_UP               RM_CHXCFG_MUXID(64U)                                                         /*!< DMAMUX TIMER4 UP request */
#define DMA_REQUEST_TIMER4_TRG              RM_CHXCFG_MUXID(65U)                                                         /*!< DMAMUX TIMER4 TRG request */
#define DMA_REQUEST_ADC1_ROUTINE            RM_CHXCFG_MUXID(66U)                                                         /*!< DMAMUX ADC1 ROUTINE request */
#define DMA_REQUEST_ADC1_INSERTED           RM_CHXCFG_MUXID(67U)                                                         /*!< DMAMUX ADC1 INSERTED request */
#define DMA_REQUEST_ADC2_ROUTINE            RM_CHXCFG_MUXID(68U)                                                         /*!< DMAMUX ADC2 ROUTINE request */
#define DMA_REQUEST_ADC2_INSERTED           RM_CHXCFG_MUXID(69U)                                                         /*!< DMAMUX ADC2 INSERTED request */
#define DMA_REQUEST_TIMER15_CH0             RM_CHXCFG_MUXID(72U)                                                         /*!< DMAMUX TIMER15 CH0 request */
#define DMA_REQUEST_TIMER15_CH1             RM_CHXCFG_MUXID(73U)                                                         /*!< DMAMUX TIMER15 CH1 request */
#define DMA_REQUEST_TIMER15_MCH0            RM_CHXCFG_MUXID(74U)                                                         /*!< DMAMUX TIMER15 MCH0 request */
#define DMA_REQUEST_TIMER15_UP              RM_CHXCFG_MUXID(75U)                                                         /*!< DMAMUX TIMER15 UP request */
#define DMA_REQUEST_TIMER15_TRG             RM_CHXCFG_MUXID(76U)                                                         /*!< DMAMUX TIMER15 TRG request */
#define DMA_REQUEST_TIMER15_CMT             RM_CHXCFG_MUXID(77U)                                                         /*!< DMAMUX TIMER15 CMT request */
#define DMA_REQUEST_TIMER16_CH0             RM_CHXCFG_MUXID(78U)                                                         /*!< DMAMUX TIMER16 CH0 request */
#define DMA_REQUEST_TIMER16_CH1             RM_CHXCFG_MUXID(79U)                                                         /*!< DMAMUX TIMER16 CH1 request */
#define DMA_REQUEST_TIMER16_MCH0            RM_CHXCFG_MUXID(80U)                                                         /*!< DMAMUX TIMER16 MCH0 request */
#define DMA_REQUEST_TIMER16_UP              RM_CHXCFG_MUXID(81U)                                                         /*!< DMAMUX TIMER16 UP request */
#define DMA_REQUEST_TIMER16_TRG             RM_CHXCFG_MUXID(82U)                                                         /*!< DMAMUX TIMER16 TRG request */
#define DMA_REQUEST_TIMER16_CMT             RM_CHXCFG_MUXID(83U)                                                         /*!< DMAMUX TIMER16 CMT request */
#define DMA_REQUEST_CAU_IN                  RM_CHXCFG_MUXID(84U)                                                         /*!< DMAMUX CRYP IN request */
#define DMA_REQUEST_CAU_OUT                 RM_CHXCFG_MUXID(85U)                                                         /*!< DMAMUX CRYP OUT request */
#define DMA_REQUEST_HAU_IN                 RM_CHXCFG_MUXID(86U)                                                         /*!< DMAMUX HASH IN request */

/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)             (BITS(0,4) & ((uint32_t)(regval) << 0U))                                     /*!< trigger input identification */
#define DMAMUX_TRIGGER_EVT0_OUT           RG_CHXCFG_TID(0U)                                                            /*!< trigger input is Evt0_out */
#define DMAMUX_TRIGGER_EVT1_OUT           RG_CHXCFG_TID(1U)                                                            /*!< trigger input is Evt1_out */
#define DMAMUX_TRIGGER_EVT2_OUT           RG_CHXCFG_TID(2U)                                                            /*!< trigger input is Evt2_out */
#define DMAMUX_TRIGGER_EVT3_OUT           RG_CHXCFG_TID(3U)                                                            /*!< trigger input is Evt3_out */
#define DMAMUX_TRIGGER_EXTI0_IT           RG_CHXCFG_TID(4U)                                                            /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1_IT           RG_CHXCFG_TID(5U)                                                            /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2_IT           RG_CHXCFG_TID(6U)                                                            /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3_IT           RG_CHXCFG_TID(7U)                                                            /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4_IT           RG_CHXCFG_TID(8U)                                                            /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5_IT           RG_CHXCFG_TID(9U)                                                            /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6_IT           RG_CHXCFG_TID(10U)                                                           /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7_IT           RG_CHXCFG_TID(11U)                                                           /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI0_EVT          RG_CHXCFG_TID(12U)                                                           /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI1_EVT          RG_CHXCFG_TID(13U)                                                           /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI2_EVT          RG_CHXCFG_TID(14U)                                                           /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI3_EVT          RG_CHXCFG_TID(15U)                                                           /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI4_EVT          RG_CHXCFG_TID(16U)                                                           /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI5_EVT          RG_CHXCFG_TID(17U)                                                           /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI6_EVT          RG_CHXCFG_TID(18U)                                                           /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI7_EVT          RG_CHXCFG_TID(19U)                                                           /*!< trigger input is EXTI15 */

