wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_dma.h
/* DMAMUX request generator trigger polarity */
#define RG_CHXCFG_RGTP(regval)            (BITS(17,18) & ((uint32_t)(regval) << 17U))                                  /*!< DMA request generator trigger polarity */
#define DMAMUX_GEN_NO_EVENT               RG_CHXCFG_RGTP(0U)                                                           /*!< no event detection */
#define DMAMUX_GEN_RISING                 RG_CHXCFG_RGTP(1U)                                                           /*!< rising edge */
#define DMAMUX_GEN_FALLING                RG_CHXCFG_RGTP(2U)                                                           /*!< falling edge */
#define DMAMUX_GEN_RISING_FALLING         RG_CHXCFG_RGTP(3U)                                                                                                                 /*!< rising and falling edges */

/* number of DMA requests to be generated */
#define RG_CHXCFG_NBRG(regval)            (BITS(19,23) & ((uint32_t)(regval) << 19U))                                  /*!< number of DMA requests to be generated */

/* DMAMUX request multiplexer channel synchronization input identification */
#define RM_CHXCFG_SYNCID(regval)          (BITS(24,28) & ((uint32_t)(regval) << 24U))                                  /*!< synchronization input identification */
#define DMAMUX_SYNC_EVT0_OUT              RM_CHXCFG_SYNCID(0U)                                                         /*!< synchronization input is Evt0_out */
#define DMAMUX_SYNC_EVT1_OUT              RM_CHXCFG_SYNCID(1U)                                                         /*!< synchronization input is Evt1_out */
#define DMAMUX_SYNC_EVT2_OUT              RM_CHXCFG_SYNCID(2U)                                                         /*!< synchronization input is Evt2_out */
#define DMAMUX_SYNC_EVT3_OUT              RM_CHXCFG_SYNCID(3U)                                                         /*!< synchronization input is Evt3_out */
#define DMAMUX_SYNC_EXTI0_IT              RM_CHXCFG_SYNCID(4U)                                                         /*!< synchronization input is EXTI0 */
#define DMAMUX_SYNC_EXTI1_IT              RM_CHXCFG_SYNCID(5U)                                                         /*!< synchronization input is EXTI1 */
#define DMAMUX_SYNC_EXTI2_IT              RM_CHXCFG_SYNCID(6U)                                                         /*!< synchronization input is EXTI2 */
#define DMAMUX_SYNC_EXTI3_IT              RM_CHXCFG_SYNCID(7U)                                                         /*!< synchronization input is EXTI3 */
#define DMAMUX_SYNC_EXTI4_IT              RM_CHXCFG_SYNCID(8U)                                                         /*!< synchronization input is EXTI4 */
#define DMAMUX_SYNC_EXTI5_IT              RM_CHXCFG_SYNCID(9U)                                                         /*!< synchronization input is EXTI5 */
#define DMAMUX_SYNC_EXTI6_IT              RM_CHXCFG_SYNCID(10U)                                                        /*!< synchronization input is EXTI6 */
#define DMAMUX_SYNC_EXTI7_IT              RM_CHXCFG_SYNCID(11U)                                                        /*!< synchronization input is EXTI7 */
#define DMAMUX_SYNC_EXTI0_EVT             RM_CHXCFG_SYNCID(12U)                                                        /*!< synchronization input is EXTI8 */
#define DMAMUX_SYNC_EXTI1_EVT             RM_CHXCFG_SYNCID(13U)                                                        /*!< synchronization input is EXTI9 */
#define DMAMUX_SYNC_EXTI2_EVT             RM_CHXCFG_SYNCID(14U)                                                        /*!< synchronization input is EXTI10 */
#define DMAMUX_SYNC_EXTI3_EVT             RM_CHXCFG_SYNCID(15U)                                                        /*!< synchronization input is EXTI11 */
#define DMAMUX_SYNC_EXTI4_EVT             RM_CHXCFG_SYNCID(16U)                                                        /*!< synchronization input is EXTI12 */
#define DMAMUX_SYNC_EXTI5_EVT             RM_CHXCFG_SYNCID(17U)                                                        /*!< synchronization input is EXTI13 */
#define DMAMUX_SYNC_EXTI6_EVT             RM_CHXCFG_SYNCID(18U)                                                        /*!< synchronization input is EXTI14 */
#define DMAMUX_SYNC_EXTI7_EVT             RM_CHXCFG_SYNCID(19U)                                                        /*!< synchronization input is EXTI15 */

/* DMAMUX request multiplexer synchronization input polarity */
#define RM_CHXCFG_SYNCP(regval)           (BITS(17,18) & ((uint32_t)(regval) << 17U))                                  /*!< synchronization input polarity */
#define DMAMUX_SYNC_NO_EVENT              RM_CHXCFG_SYNCP(0U)                                                          /*!< no event detection */
#define DMAMUX_SYNC_RISING                RM_CHXCFG_SYNCP(1U)                                                          /*!< rising edge */
#define DMAMUX_SYNC_FALLING               RM_CHXCFG_SYNCP(2U)                                                          /*!< falling edge */
#define DMAMUX_SYNC_RISING_FALLING        RM_CHXCFG_SYNCP(3U)                                                          /*!< rising and falling edges */

/* number of DMA requests to forward */
#define RM_CHXCFG_NBR(regval)            (BITS(19,23) & ((uint32_t)(regval) << 19U))                                   /*!< number of DMA requests to forward */

/* function declarations */
/* DMA deinitialization and initialization functions */
/* deinitialize DMA a channel registers */
void dma_deinit(uint32_t dma_periph, dma_channel_enum channelx);
/* initialize the parameters of DMA struct with the default values */
void dma_struct_para_init(dma_parameter_struct *init_struct);
/* initialize DMA channel */
void dma_init(uint32_t dma_periph, dma_channel_enum channelx, dma_parameter_struct *init_struct);
/* enable DMA circulation mode */
void dma_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA circulation mode */
void dma_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable memory to memory mode */
void dma_memory_to_memory_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable memory to memory mode */
void dma_memory_to_memory_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable DMA channel */
void dma_channel_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA channel */
void dma_channel_disable(uint32_t dma_periph, dma_channel_enum channelx);

/* DMA configuration functions */
/* set DMA peripheral base address */
void dma_periph_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t address);
/* set DMA memory base address */
void dma_memory_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t address);
/* set the number of remaining data to be transferred by the DMA */
void dma_transfer_number_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t number);
/* get the number of remaining data to be transferred by the DMA */
uint32_t dma_transfer_number_get(uint32_t dma_periph, dma_channel_enum channelx);
/* configure priority level of DMA channel */
void dma_priority_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t priority);
/* configure transfer data size of memory */
void dma_memory_width_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t mwidth);
/* configure transfer data size of peripheral */
void dma_periph_width_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t pwidth);
/* enable next address increasement algorithm of memory */
void dma_memory_increase_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable next address increasement algorithm of memory */
void dma_memory_increase_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable next address increasement algorithm of peripheral */
void dma_periph_increase_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable next address increasement algorithm of peripheral */
void dma_periph_increase_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* configure the direction of data transfer on the channel */
void dma_transfer_direction_config(uint32_t dma_periph, dma_channel_enum channelx,
                                   uint32_t direction);

